Cloud/rails/movieApp/app/controllers/reviews_controller.rb

  def index
    # For URL like /movies/1/reviews
    # Get the movie with id=1
    @movie = Movie.find(params[:movie_id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def show
    @movie = Movie.find(params[:movie_id])
    # For URL like /movies/1/reviews/2
    # Find an review in movies 1 that has id=2
    @review = @movie.reviews.find(params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT ?  [["movie_id", 1], ["id", 1], ["LIMIT", 1]]

  def new
    @movie = Movie.find(params[:movie_id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @movie = Movie.find(params[:movie_id])
    # For URL like /movies/1/reviews
    # Populate an review associate with movie 1 with form data
    # Movie will be associated with the review
    # @review = @movie.reviews.build(params.require(:review).permit!)
    @review = @movie.reviews.build(params.require(:review).permit(:details))
    if @review.save
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("details", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["details", "Spicy"], ["movie_id", 1], ["created_at", "2022-02-28 22:40:28.658457"], ["updated_at", "2022-02-28 22:40:28.658457"]]

  def edit
    @movie = Movie.find(params[:movie_id])
    # For URL like /movies/1/reviews/2/edit
    # Get review id=2 for movie 1
    @review = @movie.reviews.find(params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT ?  [["movie_id", 1], ["id", 1], ["LIMIT", 1]]

  def update
    @movie = Movie.find(params[:movie_id])
    @review = Review.find(params[:id])

    if @review.update(params.require(:review).permit(:details))
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "reviews" SET "details" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["details", "noice"], ["updated_at", "2022-02-28 22:40:35.938814"], ["id", 1]]

  def destroy
    @movie = Movie.find(params[:movie_id])
    @review = Review.find(params[:id])
    @review.destroy
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 1]]