Cloud/rails/movieApp/app/views/movies/show.html.erb

<h2>Reviews</h2>
<% @movie.reviews.each do |review| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 1]]